/** ============江苏echarts地图 begin==========*/
/*
var city_name = "江苏";
var city_json = {"南京":"320100","无锡":"320200","徐州":"320300","常州":"320400","苏州":"320500","南通":"320600","连云港":"320700","淮安":"320800","盐城":"320900","扬州":"321000","镇江":"321100","泰州":"321200","宿迁":"321300"};
var nameMap = {};
*/
/** ============江苏echarts地图 end==========*/


/** ============河南echarts地图 begin==========*//*

var city_name = "河南";
var city_json = {"郑州":"400001","开封":"400002","洛阳":"400003","平顶山":"400004","安阳":"400005","鹤壁":"400006","新乡":"400007","焦作":"400008","濮阳":"400009","许昌":"400010","漯河":"400011","三门峡":"400012","南阳":"400013","商丘":"400014","信阳":"400015","周口":"400016","驻马店":"400017","济源":"400018"};
var nameMap = {};

*//** ============河南echarts地图 end==========*//*


*//** ============上海echarts地图 begin==========*//*
var city_name = "上海";
var city_json = {};
var nameMap = {
        '崇明县': '崇明',
        '宝山区': '宝山',
        '嘉定区': '嘉定',
        '青浦区': '青浦',
        '松江区': '松江',
        '金山区': '金山',
        '奉贤区': '奉贤',
        '南汇区': '南汇',
        '闵行区': '闵行',
        '徐汇区': '徐汇',
        '长宁区': '长宁',
        '浦东新区': '浦东',
        '杨浦区': '杨浦',
        '闸北区': '闸北',
        '虹口区': '虹口',
        '普陀区': '普陀',
        '黄埔区': '黄埔'
    };
var nameMapSH = {
		'青浦区': '青浦',
		'金山区': '金山',
		'长宁区': '西区',
		'普陀区': '西区',
		'静安区': '西区',
		'闵行区': '莘闵',
		'浦东新区': '浦东',
		'松江区': '松江',
		'崇明县': '崇明',
		'宝山区': '宝山',
		'奉贤区': '奉贤',
		'嘉定区': '嘉定',
		'徐汇区': '南区',
        '虹口区': '北区',
        '黄浦区': '中区',
		'卢湾区': '中区',
        '杨浦区': '东区',
		'闸北区': '北区',
		'南汇区': '浦东'
    };

*//** ============上海echarts地图 begin==========*//*


*//** ============新疆echarts地图 begin==========*//*

var city_name = "新疆";
var city_json = {"阿克苏地区":"700000","阿拉尔":"700001","阿勒泰地区":"700002","巴音郭楞蒙古自治州":"700003","北屯市":"700004","博尔塔拉蒙古自治州":"700005","昌吉回族自治州":"700006","哈密地区":"700007","和田地区":"700008","喀什地区":"700009","可克达拉市":"700010","克拉玛依":"700011","克孜勒苏柯尔克孜自治州":"700012","昆玉":"700013","石河子":"700014","双河市":"700015","塔城地区":"700016","铁门关":"700017","图木舒克":"700018","吐鲁番":"700019","乌鲁木齐":"700020","五家渠":"700021","伊犁哈萨克自治州":"700022"};
var nameMap = {};

*//** ============新疆echarts地图 end==========*//*



*//** ============黑龙江echarts地图 begin==========*//*

var city_name = "黑龙江";
var city_json = {"大庆":"900001","大兴安岭地区":"900002","哈尔滨":"900003","鹤岗":"900004","黑河":"900005","鸡西":"900006","佳木斯":"900007","牡丹江":"900008","七台河":"900009","齐齐哈尔":"900010","双鸭山":"900011","绥化":"900012","伊春":"900013"};
var nameMap = {};

*//** ============黑龙江echarts地图 end==========*//*

/** ============安徽echarts地图 begin==========*/

var city_name = "安徽";
var city_json = {"合肥市":"340100","芜湖市":"340200","蚌埠市":"340300","淮南市":"340400","马鞍山市":"340500","淮北市":"340600","铜陵市":"340700","安庆市":"340800","黄山市":"341000","滁州市":"341100","阜阳市":"341200","宿州市":"341300","六安市":"341500","亳州市":"341600","池州市":"341700","宣城市":"341800"};
var nameMap = {};

/** ============安徽echarts地图 end==========*//*


*//** ============福建echarts地图 begin==========*/

/*var city_name = "福建";
var city_json = {"福州":"600001","龙岩":"600002","南平":"600003","宁德":"600004","莆田":"600005","泉州":"600006","三明":"600007","厦门":"600008","漳州":"600009"};
var nameMap = {};*/

/** ============福建echarts地图 end==========*//*

*//** ============云南echarts地图 begin==========*/

/*var city_name = "云南";
var city_json = {"昆明":"500001","曲靖":"500002","玉溪":"500003","保山":"500004","昭通":"500005","丽江":"500006","普洱":"500007","临沧":"500008","楚雄":"500009","红河":"500010","文山":"500011","西双版纳":"500012","大理":"500013","德宏":"500014","怒江":"500015","迪庆":"500016"};
var nameMap = {"昆明":"昆明","曲靖":"曲靖","玉溪":"玉溪","保山":"保山","昭通":"昭通","丽江":"丽江","普洱":"普洱","临沧":"临沧","楚雄彝族自治州":"楚雄","红河哈尼族彝族自治州":"红河","文山壮族苗族自治州":"文山","西双版纳傣族自治州":"西双版纳","大理白族自治州":"大理","德宏傣族景颇族自治州":"德宏","怒江傈僳族自治州":"怒江","迪庆藏族自治州":"迪庆"};*/

/** ============云南echarts地图 end==========*//*








*/